"""Сообщение в виде битовой карты"""
import sys

# (!) Попробуйте заменить это многострочное строковое значение на любое
# другое изображение
# Вверху и внизу строки расположено 68 точек:
# (Можете также скопировать и вставить это строковое значение из
# из https://inventwithpython.com/bitmapworld.txt)
bitmap = """
....................................................................
  **************   * *** ** *       ******************************
 ********************* ** ** * * ****************************** *
**       *****************     ******************************
          *************        ** * **** ** ************** *
           *********          *******  **************** * *
            ********         *************************** *
   *        * **** ***       *************** ****** ** *
               **** *        ***************   *** *** *
                ******       *************     **   ** *
                ********      *************     * ** ***
                  ********       ********          * *** ****
                  *********       ****** *         **** ** * **
                  *********       ****** * *           *** *   *
                    ******        ***** **             *****   *
                    *****          **** *            ********
                   *****           ****              *********
                   ****            **                 *******   *
                   ***                                     *    *
                   **    *                         *
...................................................................."""

print('Enter the message to display with the bitmap.')
message = input('> ')
if message == '':
    sys.exit()

# Проходим в цикле по всем строкам битовой карты:
for line in bitmap.splitlines():
    # Проходим в цикле по всем символам строки:
    for i, bit in enumerate(line):
        if bit == ' ':
            # Выводим пустое пространство согласно пробелу в битовой карте:
            print(' ', end='')
        else:
            # Выводим символ сообщения:
            print(message[i % len(message)], end='')
        print()     # Выводим символ новой строки.
